using HomeWork3_13_1;

// Я зробив відступ від завдання в наступних моментах:
//   1) >> Довжина кожного ланцюжка визначається випадково.
//   я маю заздалегідь згенеровані слова, що містяться в Manager'і і рандомним чином їх обираю
// 
//   2) >> Під час падіння ланцюжка на кожному кроці всі символи змінюють своє значення
//   начебто в "оригінальній" матриці міняється лише перший (активний) символ з слова, а не всі, тому і я рандомайзю лише перший активний символ в слові

var manager = new Manager(30);
manager.Start();